namespace ProjCharGenerator
{
    public class PairWordGenerator
    {
        private string[] _baseCombination;

        private int[] _weights;

        public SequenceGenerator SequenceGenerator { get; }

        public PairWordGenerator()
        {
            InitializeSequence();
            InitializeWeights();

            SequenceGenerator = new SequenceGenerator(_baseCombination, _weights);
        }

        private void InitializeSequence()
        {
            _baseCombination = new string[100]
            {
                "и не", "и в", "потому что", "я не", "у меня", "может быть", "то что", "что он", "не было",
                "в том", "у нас", "в этом", "у него", "что в", "не только", "том что", "что я", "и на",
                "ничего не", "так и", "и с", "он не", "и я", "о том", "и все", "но и", "с ним", "а в", "так как",
                "что это", "как бы", "все это", "как и", "да и", "вместе с", "не в", "то есть", "и что", "и он",
                "никогда не", "к нему", "не может", "если бы", "а я", "так что", "он был", "а не", "об этом",
                "и даже", "что не", "это не", "еще не", "но не", "и как", "не мог", "из них", "не знаю", "на него",
                "в нем", "а потом", "что же", "в то", "при этом", "уже не", "в его", "это было", "во время", "что она",
                "того что", "как будто", "то же", "но в", "как в", "ко мне", "так же", "а также", "и по", "что у",
                "у них", "и т", "и так", "и вот", "один из", "никто не", "в москве", "и его", "у вас", "к тому",
                "не могу", "в конце", "что вы", "но я", "что они", "я и", "только в", "его в", "таким образом",
                "что и", "в россии", "несмотря на"
            };
        }

        private void InitializeWeights()
        {
            _weights = new int[100]
            {
                2013, 1939, 1174, 1137, 971, 960, 952, 927, 927, 898, 864, 848, 829, 803, 802, 778, 756, 743, 718,
                716, 710, 687, 686, 672, 669, 662, 659, 600, 583, 579, 568, 529, 506, 502, 495, 492, 492, 491, 488,
                483, 482, 480, 476, 475, 475, 472, 466, 451, 449, 449, 448, 447, 444, 425, 423, 413, 403, 403, 403,
                402, 401, 399, 399, 390, 385, 380, 379, 374, 372, 371, 371, 369, 368, 364, 364, 361, 352, 351, 345,
                339, 337, 335, 333, 333, 331, 330, 330, 328, 327, 325, 324, 319, 313, 310, 308, 307, 302, 302, 299, 297
            };
        }
    }
}
