
﻿using System;
using System.IO;

namespace generator
{
    class CharGenerator
    {
        private string syms = "абвгдежзийклмнопрстуфхцчшщыьэюя";
        private char[] data;
        private int size;
        private int index = 0;
        private Random random = new Random();
        int[,] weights = new int[,] {
        {2, 12, 35, 8,14,7,6,15,7,7,19,27,19,45,5,11,26,31,27,3,1,10,6,7,10,1,0,0,2,6,9 },
        {5,0,0,0,0,9,1,0,6,0,0,6,0,2,21,0,8,1,0,6,0,0,0,0,0,1,11,0,0,0,2},
        {35,1,5,3,3,32,0,2,17,0,7,10,3,9,58,6,6,19,6,7,0,1,1,2,4,1,18,1,2,0,3},
        {7,0,0,0,3,3,0,0,5,0,1,5,0,1,50,0,7,0,0,2,0,0,0,0,0,0,0,0,0,0,0 },
        {25,0,3,1,1,29,1,1,13,0,1,5,1,13,22,3,6,8,1,10,0,0,1,1,1,0,5,1,0,0,1 },
        {2,9,18,11,27,7,5,10,6,15,13,35,24,63,7,16,39,37,33,3,1,8,3,7,3,3,0,0,1,1,2 } ,
        {5,1,0,0,6,12,0,0,5,0,0,0,0,6,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        {35,1,7,1,5,3,0,0,4,0,2,1,2,9,9,9,3,1,0,2,0,0,0,0,0,0,4,0,0,0,4 },
        { 4,6,22,5,10,21,2,23,19,11,19,21,20,32,8,13,11,29,29,3,1,17,3,11,1,1,0,0,1,3,17 },
        {1,1,4,1,3,0,1,2,4,0,5,1,2,7,9,7,3,10,2,0,0,0,1,3,2,0,0,0,0,0,0 },
        {24,1,4,1,0,4,1,1,26,0,1,4,1,2,66,2,10,3,7,10,0,0,1,0,0,0,0,0,0,0,0 },
        {25,1,1,1,1,33,2,1,36,0,1,2,1,8,30,2,0,3,1,6,0,4,0,1,0,0,3,20,0,4,9 },
        {18,2,4,1,1,21,1,2,23,0,3,1,3,7,19,5,2,5,3,9,1,0,0,2,0,0,5,1,1,0,3 },
        {54,1,2,3,3,34,0,0,58,0,3,0,1,24,67,2,1,9,9,7,1,0,5,2,0,0,36,3,0,0,5 },
        {1,28,84,32,47,15,7,18,12,29,19,41,38,30,9,18,43,50,39,3,2,5,2,12,4,3,0,0,2,3,2 },
        {7,0,0,0,0,15,0,0,4,0,0,9,0,1,46,0,41,1,0,6,0,0,0,0,0,0,2,0,0,0,2 },
        {55,1,4,4,3,37,3,1,24,0,3,1,3,7,56,2,1,5,9,16,0,1,1,1,2,0,8,3,0,0,5 },
        {8,1,7,1,2,25,0,0,6,0,40,13,3,9,27,11,4,11,82,6,0,1,1,2,2,0,1,8,0,0,17 },
        {35,1,27,1,3,31,0,1,28,0,5,1,1,11,56,4,26,18,2,10,0,0,0,1,0,0,11,21,0,0,4 },
        { 1,4,4,4,11,2,6,3,2,0,8,5,5,5,1,5,7,14,7,0,0,1,0,8,3,2,0,0,0,9,1 },
        {2,0,0,0,0,2,0,0,2,0,0,0,0,0,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        {4,1,4,1,3,1,0,2,3,0,4,3,3,4,18,5,3,4,2,2,1,0,0,1,0,0,0,0,0,0,0 },
        {3,0,0,0,0,7,0,0,10,0,2,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0 },
        {12,0,0,0,0,23,0,0,13,0,2,0,0,6,0,0,0,0,7,1,0,0,0,0,1,0,0,1,0,0,0 },
        {5,0,0,0,0,11,0,0,14,0,1,2,0,2,2,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0 },
        {3,0,0,0,0,8,0,0,6,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0 },
        {0,1,9,1,3,12,0,2,4,7,3,6,6,3,2,10,3,9,4,1,0,16,0,1,2,0,0,0,0,0,0 },
        {0,2,4,1,1,2,0,2,2,0,6,0,3,13,2,4,1,11,3,0,0,0,0,1,4,0,0,0,1,3,1 },
        {0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,1,9,0,0,0,0,0,0,0,0,0,0,0,0 },
        {0,2,1,2,1,0,0,3,1,0,1,0,1,1,1,3,1,1,7,0,0,0,1,1,0,4,0,0,0,0,0 },
        {1,3,9,1,3,3,1,5,3,2,3,3,4,6,3,6,3,6,10,0,0,2,1,4,1,1,0,0,1,1,1 }
        };

        int[] np;
        int summa = 0;
        public CharGenerator()
        {
            size = syms.Length;
            if (size != weights.GetLength(0))
            {
                Console.WriteLine("Error!");
                Environment.Exit(1);
            }
            data = syms.ToCharArray();

        }
        public char getSym()
        {
            summa = 0;
            int[] temp = new int[size];
            for (int i = 0; i < size; i++)
                temp[i] = weights[index, i];

            for (int i = 0; i < size; i++)
                summa += temp[i];
            np = new int[size];
            int s2 = 0;
            for (int i = 0; i < size; i++)
            {
                s2 += temp[i];
                np[i] = s2;
            }
            int m = random.Next(0, summa);
            int j;
            for (j = 0; j < size; j++)
            {
                if (m < np[j])
                    break;
            }
            index = j;
            return data[j];
        }
    }

    class CharGenerator1
    {
        private string syms = "и в не на я он быть что с а как то она к этот это по но они мы свой который из весь у за от о так же вы для мочь ты год один его тот человек всё только такой бы себя сказать ещё мой или говорить до время уже когда другой наш да если знать вот сам ни день дело при стать чтобы самый жизнь очень нет во даже два рука её первый ли под со кто где новый слово какой раз теперь их идти без после иметь там ничто должен большой видеть место хотеть можно глаз";
        private string[] data;
        private int size;
        //private int index = 0;
        private Random random = new Random();
        int[] weights = new int[] {
            38310, 30273, 17480, 15322,13348,13213,12935,12485,11360,7518,
            6691, 6038, 5949, 5835, 5633, 5600, 5579, 5507, 5116, 4734, 
            4589, 4548, 4457, 4315, 4198, 3971, 3920, 3636, 3625, 3463,
            3106, 3071, 3043, 2987, 2969, 2965, 2947, 2927, 2896, 2819,
            2638, 2571, 2532, 2499, 2457, 2402, 2182, 2156, 2139, 2120,
            2051, 2023, 2020, 2011, 1916, 1748, 1730, 1721, 1650, 1650,
            1593, 1563, 1557, 1503, 1489, 1486, 1472, 1420, 1404, 1403,
            1384, 1373, 1362, 1312, 1297, 1275, 1214, 1175, 1173, 1167,
            1163, 1151, 1141, 1135, 1117, 1077, 1073, 1073, 1066, 1055,
            1052, 1040, 1036, 1009, 1004, 1000, 988, 985, 966, 958

        };

        int[] np;
        int summa = 0;
        public CharGenerator1()
        {
            data = syms.Split(" ");
            size = data.Length;
            if (size != weights.Length)
            {
                Console.WriteLine("Error!");
                Environment.Exit(1);
            }
            for (int i = 0; i < size; i++)
                summa += weights[i];
            np = new int[size];
            int s2 = 0;
            for (int i = 0; i < size; i++)
            {
                s2 += weights[i];
                np[i] = s2;
            }
        }
        public string getSym()
        {
            int m = random.Next(0, summa);
            int j;
            for (j = 0; j < size; j++)
            {
                if (m < np[j])
                    break;
            }
            return data[j];
        }
    }

    class CharGenerator2
    {
        private string syms = "и не,и в,потому что,я не,у меня,может быть,то что,что он,не было,в том,у нас,в этом,у него,что в,не только,том что,что я,и на,гичего не,так и,и с,он не,и я,о том,и все,но и,с ним,а в,так как,что это,как бы,все это,как и,да и,вместе с,не в,то есть,и что,и он,никогда не,к нему,не может,если бы,а я,так что,он был,а не,об этом,и даже,что не,это не,еще не,но не,и как,не мог,из них,не знаю,на него,в нем,а потом,что же,в то,при этом,уже не,в его,это было,во время,что она,того что,как будто,то же,но в,как в,ко мне,так же,а также,и по,что у,у них,и ты,и так,и вот,один из,никто не,в москве,и его,у вас,к тому,не могу,в конце,что вы,но я,что они,я и,только в,его в,таким образом,что и,в россии,несмотря на";
        private string[] data;
        private int size;
       // private int index = 0;
        private Random random = new Random();
        int[] weights = new int[] {
            201352, 193983, 117401, 113767, 97102, 96065, 95251, 92743, 92729, 89842,
            86446, 84820, 82963, 80398, 80252, 77858, 75642, 74347, 71816, 71614,
            71079, 68787, 68653, 67202, 66971, 66247, 65937, 60045, 58376, 57962,
            56860, 52951, 50613, 50243, 49521, 49285, 49262, 49137, 48879, 48344,
            48224, 48027, 47665, 47558, 47525, 47234, 46620, 45100, 44977, 44953,
            44867, 44753, 44428, 42588, 42307, 41386, 40338, 40336, 40316, 40259,
            40197, 39971, 39931, 39037, 38517, 38081, 37952, 37436, 37244, 37176,
            37103, 36943, 36837, 36495, 36435, 36133, 35266, 35149, 34548, 33965,
            33734, 33586, 33342, 33320, 33159, 33095, 33010, 32814, 32714, 32590,
            32428, 31972, 31330, 31004, 30819, 30782, 30278, 30274, 29973, 29741

        };
        int[] np;
        int summa = 0;
        public CharGenerator2()
        {
            data = syms.Split(",");
            size = data.Length;
            if (size != weights.Length)
            {
                Console.WriteLine("Error!");
                Environment.Exit(1);
            }
            for (int i = 0; i < size; i++)
                summa += weights[i];
            np = new int[size];
            int s2 = 0;
            for (int i = 0; i < size; i++)
            {
                s2 += weights[i];
                np[i] = s2;
            }
        }
        public string getSym()
        {
            int m = random.Next(0, summa);
            int j;
            for (j = 0; j < size; j++)
            {
                if (m < np[j])
                    break;
            }
            return data[j];
        }
    }
    class Program
    {
        static void Main(string[] args)
        {
            StreamWriter f = new StreamWriter("exemple1.txt");
            string temp = "";
            CharGenerator gen = new CharGenerator();
            for (int i = 0; i < 1000; i++)
            {
                char ch = gen.getSym();
                temp += ch + " ";
               
                if ((i+1) % 30 == 0 )
                {
                    f.WriteLine(temp);
                    temp = "";
                }     
            }
            f.WriteLine(temp);
            f.Close();
            StreamWriter f2 = new StreamWriter("exemple2.txt");
            temp = "";
            CharGenerator1 gen2 = new CharGenerator1();

            for (int i = 0; i < 1000; i++)
            {
                string ch = gen2.getSym();
                temp += ch + " ";

                if ((i + 1) % 30 == 0)
                {
                    f2.WriteLine(temp);
                    temp = "";
                }
            }
            f2.WriteLine(temp);
            f2.Close();
            StreamWriter f3 = new StreamWriter("exemple3.txt");
            temp = "";
            CharGenerator2 gen3 = new CharGenerator2();

            for (int i = 0; i < 1000; i++)
            {
                string ch = gen3.getSym();
                temp += ch + " ";

                if ((i + 1) % 30 == 0)
                {
                    f3.WriteLine(temp);
                    temp = "";
                }

            }
            f3.WriteLine(temp);
            f3.Close();
            
        }
    }
}
