namespace ProjCharGenerator
{
    public class WordGenerator
    {
        private string[] _baseCombination;

        private int[] _weights;

        public SequenceGenerator SequenceGenerator { get; }

        public WordGenerator()
        {
            InitializeSequence();
            InitializeWeights();

            SequenceGenerator = new SequenceGenerator(_baseCombination, _weights);
        }

        private void InitializeSequence()
        {
            _baseCombination = new string[100]
            {
                "и", "в", "не", "на", "с", "что", "я", "а", "он", "как", "к", "по", "но", "его",
                "это", "из", "все", "у", "за", "от", "то", "о", "же", "так", "для", "было", "она",
                "только", "мы", "бы", "мне", "был", "ее", "или", "еще", "меня", "их", "они", "до",
                "когда", "уже", "ты", "если", "да", "вы", "вот", "при", "ни", "ему", "чтобы", "нет",
                "есть", "даже", "может", "быть", "во", "время", "очень", "были", "была", "сказал",
                "ли", "под", "со", "себя", "нас", "где", "него", "чем", "того", "без", "будет",
                "этого", "теперь", "после", "там", "можно", "этом", "раз", "себе", "тем", "этот",
                "ну", "том", "потом", "более", "них", "которые", "всех", "человек", "ничего", "надо",
                "тут", "тогда", "здесь", "потому", "один", "кто", "через", "который"
            };
        }

        private void InitializeWeights()
        {
            _weights = new int[100]
            {
                7416, 5842, 3385, 2936, 2228, 2210, 1592, 1541, 1377, 1300, 1132, 1071, 1048, 983,
                957, 836, 817, 798, 754, 747, 695, 685, 665, 663, 600, 592, 553, 516, 501, 485, 449,
                442, 438, 434, 432, 422, 415, 412, 400, 390, 385, 348, 347, 338, 338, 310, 305, 305,
                302, 286, 269, 267, 264, 263, 262, 259, 255, 252, 249, 246, 233, 231, 228, 222, 220,
                218, 216, 216, 213, 209, 205, 204, 202, 201, 195, 192, 189, 189, 184, 180, 177, 176,
                175, 174, 173, 170, 168, 167, 167, 166, 163, 162, 160, 159, 158, 157, 157, 156, 153, 151
            };
        }
    }
}
